akbar-q/Matlab-Simulink/ESP32Arm6DOF_ert_rtw/ESP32Arm6DOF.h
/*
 * File: ESP32Arm6DOF.h
 *
 * Code generated for Simulink model 'ESP32Arm6DOF'.
 *
 * Model version                  : 1.43
 * Simulink Coder version         : 24.1 (R2024a) 19-Nov-2023
 * C/C++ source code generated on : Wed Apr 30 11:27:39 2025
 *
 * Target selection: ert.tlc
 * Embedded hardware selection: ARM Compatible->ARM Cortex
 * Code generation objectives: Unspecified
 * Validation result: Not run
 */

#ifndef ESP32Arm6DOF_h_
#define ESP32Arm6DOF_h_
#ifndef ESP32Arm6DOF_COMMON_INCLUDES_
#define ESP32Arm6DOF_COMMON_INCLUDES_
#include "rtwtypes.h"
#include "rtw_continuous.h"
#include "rtw_solver.h"
#include "MW_ServoWriteRead.h"
#include "vl53l0x_main.h"
#endif                                 /* ESP32Arm6DOF_COMMON_INCLUDES_ */

#include "ESP32Arm6DOF_types.h"
#include <math.h>
#include <string.h>
#include "rt_nonfinite.h"
#include <stddef.h>
#include "zero_crossing_types.h"

/* Macros for accessing real-time model data structure */
#ifndef rtmGetContStateDisabled
#define rtmGetContStateDisabled(rtm)   ((rtm)->contStateDisabled)
#endif

#ifndef rtmSetContStateDisabled
#define rtmSetContStateDisabled(rtm, val) ((rtm)->contStateDisabled = (val))
#endif

#ifndef rtmGetContStates
#define rtmGetContStates(rtm)          ((rtm)->contStates)
#endif

#ifndef rtmSetContStates
#define rtmSetContStates(rtm, val)     ((rtm)->contStates = (val))
#endif

#ifndef rtmGetContTimeOutputInconsistentWithStateAtMajorStepFlag
#define rtmGetContTimeOutputInconsistentWithStateAtMajorStepFlag(rtm) ((rtm)->CTOutputIncnstWithState)
#endif

#ifndef rtmSetContTimeOutputInconsistentWithStateAtMajorStepFlag
#define rtmSetContTimeOutputInconsistentWithStateAtMajorStepFlag(rtm, val) ((rtm)->CTOutputIncnstWithState = (val))
#endif

#ifndef rtmGetDerivCacheNeedsReset
#define rtmGetDerivCacheNeedsReset(rtm) ((rtm)->derivCacheNeedsReset)
#endif

#ifndef rtmSetDerivCacheNeedsReset
#define rtmSetDerivCacheNeedsReset(rtm, val) ((rtm)->derivCacheNeedsReset = (val))
#endif

#ifndef rtmGetIntgData
#define rtmGetIntgData(rtm)            ((rtm)->intgData)
#endif

#ifndef rtmSetIntgData
#define rtmSetIntgData(rtm, val)       ((rtm)->intgData = (val))
#endif

#ifndef rtmGetOdeF
#define rtmGetOdeF(rtm)                ((rtm)->odeF)
#endif

#ifndef rtmSetOdeF
#define rtmSetOdeF(rtm, val)           ((rtm)->odeF = (val))
#endif

#ifndef rtmGetOdeY
#define rtmGetOdeY(rtm)                ((rtm)->odeY)
#endif

#ifndef rtmSetOdeY
#define rtmSetOdeY(rtm, val)           ((rtm)->odeY = (val))
#endif

#ifndef rtmGetPeriodicContStateIndices
#define rtmGetPeriodicContStateIndices(rtm) ((rtm)->periodicContStateIndices)
#endif

#ifndef rtmSetPeriodicContStateIndices
#define rtmSetPeriodicContStateIndices(rtm, val) ((rtm)->periodicContStateIndices = (val))
#endif

#ifndef rtmGetPeriodicContStateRanges
#define rtmGetPeriodicContStateRanges(rtm) ((rtm)->periodicContStateRanges)
#endif

#ifndef rtmSetPeriodicContStateRanges
#define rtmSetPeriodicContStateRanges(rtm, val) ((rtm)->periodicContStateRanges = (val))
#endif

#ifndef rtmGetZCCacheNeedsReset
#define rtmGetZCCacheNeedsReset(rtm)   ((rtm)->zCCacheNeedsReset)
#endif

#ifndef rtmSetZCCacheNeedsReset
#define rtmSetZCCacheNeedsReset(rtm, val) ((rtm)->zCCacheNeedsReset = (val))
#endif

#ifndef rtmGetdX
#define rtmGetdX(rtm)                  ((rtm)->derivs)
#endif

#ifndef rtmSetdX
#define rtmSetdX(rtm, val)             ((rtm)->derivs = (val))
#endif

#ifndef rtmGetErrorStatus
#define rtmGetErrorStatus(rtm)         ((rtm)->errorStatus)
#endif

#ifndef rtmSetErrorStatus
#define rtmSetErrorStatus(rtm, val)    ((rtm)->errorStatus = (val))
#endif

#ifndef rtmGetStopRequested
#define rtmGetStopRequested(rtm)       ((rtm)->Timing.stopRequestedFlag)
#endif

#ifndef rtmSetStopRequested
#define rtmSetStopRequested(rtm, val)  ((rtm)->Timing.stopRequestedFlag = (val))
#endif

#ifndef rtmGetStopRequestedPtr
#define rtmGetStopRequestedPtr(rtm)    (&((rtm)->Timing.stopRequestedFlag))
#endif

#ifndef rtmGetT
#define rtmGetT(rtm)                   (rtmGetTPtr((rtm))[0])
#endif

#ifndef rtmGetTPtr
#define rtmGetTPtr(rtm)                ((rtm)->Timing.t)
#endif

#ifndef rtmGetTStart
#define rtmGetTStart(rtm)              ((rtm)->Timing.tStart)
#endif

/* Block signals (default storage) */
typedef struct {
  real_T Probe[2];                     /* '<S19>/Probe' */
  real_T Probe_f[2];                   /* '<S54>/Probe' */
  real_T Probe_a[2];                   /* '<S26>/Probe' */
  real_T Probe_e[2];                   /* '<S33>/Probe' */
  real_T Probe_m[2];                   /* '<S47>/Probe' */
  real_T Probe_fr[2];                  /* '<S40>/Probe' */
  real_T Saturation;                   /* '<S46>/Saturation' */
  real_T AvoidDividebyZero;            /* '<S40>/Avoid Divide by Zero' */
  real_T uT;                           /* '<S7>/1//T' */
  real_T Saturation_d;                 /* '<S25>/Saturation' */
  real_T AvoidDividebyZero_k;          /* '<S19>/Avoid Divide by Zero' */
  real_T uT_l;                         /* '<S4>/1//T' */
  real_T Saturation_n;                 /* '<S60>/Saturation' */
  real_T AvoidDividebyZero_l;          /* '<S54>/Avoid Divide by Zero' */
  real_T uT_j;                         /* '<S9>/1//T' */
  real_T Saturation_nm;                /* '<S32>/Saturation' */
  real_T AvoidDividebyZero_c;          /* '<S26>/Avoid Divide by Zero' */
  real_T uT_g;                         /* '<S5>/1//T' */
  real_T Saturation_h;                 /* '<S39>/Saturation' */
  real_T AvoidDividebyZero_o;          /* '<S33>/Avoid Divide by Zero' */
  real_T uT_f;                         /* '<S6>/1//T' */
  real_T Saturation_i;                 /* '<S53>/Saturation' */
  real_T AvoidDividebyZero_h;          /* '<S47>/Avoid Divide by Zero' */
  real_T uT_gp;                        /* '<S8>/1//T' */
  real_T DerivativeGain;               /* '<S87>/Derivative Gain' */
  real_T FilterCoefficient;            /* '<S97>/Filter Coefficient' */
  real_T IntegralGain;                 /* '<S91>/Integral Gain' */
  real_T BaseSig;                      /* '<S13>/fromWS_Signal 1' */
  real_T LowerSignal;                  /* '<S15>/fromWS_Signal 1' */
  real_T MidSignal;                    /* '<S16>/fromWS_Signal 1' */
  real_T UpperSignal;                  /* '<S18>/fromWS_Signal 1' */
  real_T RotationSignal;               /* '<S17>/fromWS_Signal 1' */
  real_T ClawSignal;                   /* '<S14>/fromWS_Signal 1' */
} B_ESP32Arm6DOF_T;

