akbar-q/Matlab-Simulink/ESP32Arm6DOF_ert_rtw/ESP32Arm6DOF.h
/* Block states (default storage) for system '<Root>' */
typedef struct {
  codertarget_arduinobase_int_p_T obj;
                                   /* '<Root>/VL53L0X Time Of Flight Sensor.' */
  codertarget_arduinobase_int_p_T obj_i;
                                    /* '<Root>/VL53L0X Time Of Flight Sensor' */
  codertarget_arduinobase_inter_T obj_b;/* '<Root>/Upper Servo' */
  codertarget_arduinobase_inter_T obj_g;/* '<Root>/Standard Servo Write.' */
  codertarget_arduinobase_inter_T obj_l;/* '<Root>/Rotation Servo' */
  codertarget_arduinobase_inter_T obj_j;/* '<Root>/Mid Arm Servo' */
  codertarget_arduinobase_inter_T obj_h;/* '<Root>/Lower Arm Servo' */
  codertarget_arduinobase_inter_T obj_a;/* '<Root>/Claw Servo' */
  codertarget_arduinobase_inter_T obj_h5;/* '<Root>/Base Servo' */
  real_T Integrator_DSTATE;            /* '<S46>/Integrator' */
  real_T Integrator_DSTATE_k;          /* '<S25>/Integrator' */
  real_T Integrator_DSTATE_g;          /* '<S60>/Integrator' */
  real_T Integrator_DSTATE_n;          /* '<S32>/Integrator' */
  real_T Integrator_DSTATE_c;          /* '<S39>/Integrator' */
  real_T Integrator_DSTATE_p;          /* '<S53>/Integrator' */
  struct {
    void *TimePtr;
    void *DataPtr;
    void *RSimInfoPtr;
  } fromWS_Signal1_PWORK;              /* '<S13>/fromWS_Signal 1' */

  struct {
    void *TimePtr;
    void *DataPtr;
    void *RSimInfoPtr;
  } fromWS_Signal1_PWORK_p;            /* '<S15>/fromWS_Signal 1' */

  struct {
    void *TimePtr;
    void *DataPtr;
    void *RSimInfoPtr;
  } fromWS_Signal1_PWORK_n;            /* '<S16>/fromWS_Signal 1' */

  struct {
    void *TimePtr;
    void *DataPtr;
    void *RSimInfoPtr;
  } fromWS_Signal1_PWORK_d;            /* '<S18>/fromWS_Signal 1' */

  struct {
    void *TimePtr;
    void *DataPtr;
    void *RSimInfoPtr;
  } fromWS_Signal1_PWORK_f;            /* '<S17>/fromWS_Signal 1' */

  struct {
    void *TimePtr;
    void *DataPtr;
    void *RSimInfoPtr;
  } fromWS_Signal1_PWORK_nz;           /* '<S14>/fromWS_Signal 1' */

  struct {
    int_T PrevIndex;
  } fromWS_Signal1_IWORK;              /* '<S13>/fromWS_Signal 1' */

  struct {
    int_T PrevIndex;
  } fromWS_Signal1_IWORK_k;            /* '<S15>/fromWS_Signal 1' */

  struct {
    int_T PrevIndex;
  } fromWS_Signal1_IWORK_i;            /* '<S16>/fromWS_Signal 1' */

  struct {
    int_T PrevIndex;
  } fromWS_Signal1_IWORK_l;            /* '<S18>/fromWS_Signal 1' */

  struct {
    int_T PrevIndex;
  } fromWS_Signal1_IWORK_ko;           /* '<S17>/fromWS_Signal 1' */

  struct {
    int_T PrevIndex;
  } fromWS_Signal1_IWORK_a;            /* '<S14>/fromWS_Signal 1' */

  int8_T Integrator_PrevResetState;    /* '<S46>/Integrator' */
  int8_T Integrator_PrevResetState_a;  /* '<S25>/Integrator' */
  int8_T Integrator_PrevResetState_m;  /* '<S60>/Integrator' */
  int8_T Integrator_PrevResetState_l;  /* '<S32>/Integrator' */
  int8_T Integrator_PrevResetState_ah; /* '<S39>/Integrator' */
  int8_T Integrator_PrevResetState_d;  /* '<S53>/Integrator' */
  uint8_T Integrator_IC_LOADING;       /* '<S46>/Integrator' */
  uint8_T Integrator_IC_LOADING_l;     /* '<S25>/Integrator' */
  uint8_T Integrator_IC_LOADING_f;     /* '<S60>/Integrator' */
  uint8_T Integrator_IC_LOADING_o;     /* '<S32>/Integrator' */
  uint8_T Integrator_IC_LOADING_n;     /* '<S39>/Integrator' */
  uint8_T Integrator_IC_LOADING_b;     /* '<S53>/Integrator' */
  boolean_T EnabledSubsystem_MODE;     /* '<Root>/Enabled Subsystem' */
} DW_ESP32Arm6DOF_T;

/* Continuous states (default storage) */
typedef struct {
  real_T Filter_CSTATE;                /* '<S89>/Filter' */
  real_T Integrator_CSTATE;            /* '<S94>/Integrator' */
} X_ESP32Arm6DOF_T;

/* State derivatives (default storage) */
typedef struct {
  real_T Filter_CSTATE;                /* '<S89>/Filter' */
  real_T Integrator_CSTATE;            /* '<S94>/Integrator' */
} XDot_ESP32Arm6DOF_T;

/* State disabled  */
typedef struct {
  boolean_T Filter_CSTATE;             /* '<S89>/Filter' */
  boolean_T Integrator_CSTATE;         /* '<S94>/Integrator' */
} XDis_ESP32Arm6DOF_T;

/* Zero-crossing (trigger) state */
typedef struct {
  ZCSigState SampleandHold_Trig_ZCE;   /* '<Root>/Sample and Hold' */
} PrevZCX_ESP32Arm6DOF_T;

#ifndef ODE3_INTG
#define ODE3_INTG

/* ODE3 Integration Data */
typedef struct {
  real_T *y;                           /* output */
  real_T *f[3];                        /* derivatives */
} ODE3_IntgData;

#endif

/* External outputs (root outports fed by signals with default storage) */
typedef struct {
  real_T Output;                       /* '<Root>/Output.' */
} ExtY_ESP32Arm6DOF_T;

/* Parameters (default storage) */
struct P_ESP32Arm6DOF_T_ {
  real_T PIDController_D;              /* Mask Parameter: PIDController_D
                                        * Referenced by: '<S87>/Derivative Gain'
                                        */
  real_T PIDController_I;              /* Mask Parameter: PIDController_I
                                        * Referenced by: '<S91>/Integral Gain'
                                        */
  real_T PIDController_InitialConditionF;
                              /* Mask Parameter: PIDController_InitialConditionF
                               * Referenced by: '<S89>/Filter'
                               */
  real_T PIDController_InitialConditio_l;
                              /* Mask Parameter: PIDController_InitialConditio_l
                               * Referenced by: '<S94>/Integrator'
                               */
  real_T LowPassFilterDiscreteorContinuo;
                              /* Mask Parameter: LowPassFilterDiscreteorContinuo
                               * Referenced by: '<S7>/K'
                               */
  real_T LowPassFilterDiscreteorContin_p;
                              /* Mask Parameter: LowPassFilterDiscreteorContin_p
                               * Referenced by: '<S4>/K'
                               */
  real_T LowPassFilterDiscreteorContin_h;
                              /* Mask Parameter: LowPassFilterDiscreteorContin_h
                               * Referenced by: '<S9>/K'
                               */
  real_T LowPassFilterDiscreteorContin_j;
                              /* Mask Parameter: LowPassFilterDiscreteorContin_j
                               * Referenced by: '<S5>/K'
                               */
  real_T LowPassFilterDiscreteorContin_l;
                              /* Mask Parameter: LowPassFilterDiscreteorContin_l
                               * Referenced by: '<S6>/K'
                               */
  real_T LowPassFilterDiscreteorContin_f;
                              /* Mask Parameter: LowPassFilterDiscreteorContin_f
                               * Referenced by: '<S8>/K'
                               */
  real_T PIDController_N;              /* Mask Parameter: PIDController_N
                                        * Referenced by: '<S97>/Filter Coefficient'
                                        */
  real_T LowPassFilterDiscreteorContin_g;
                              /* Mask Parameter: LowPassFilterDiscreteorContin_g
                               * Referenced by: '<S40>/Time constant'
                               */
  real_T LowPassFilterDiscreteorContin_o;
                              /* Mask Parameter: LowPassFilterDiscreteorContin_o
                               * Referenced by: '<S19>/Time constant'
                               */
  real_T LowPassFilterDiscreteorContin_e;
                              /* Mask Parameter: LowPassFilterDiscreteorContin_e
                               * Referenced by: '<S54>/Time constant'
                               */
  real_T LowPassFilterDiscreteorConti_jx;
                              /* Mask Parameter: LowPassFilterDiscreteorConti_jx
                               * Referenced by: '<S26>/Time constant'
                               */
  real_T LowPassFilterDiscreteorContin_d;
                              /* Mask Parameter: LowPassFilterDiscreteorContin_d
                               * Referenced by: '<S33>/Time constant'
                               */
  real_T LowPassFilterDiscreteorContin_i;
                              /* Mask Parameter: LowPassFilterDiscreteorContin_i
                               * Referenced by: '<S47>/Time constant'
                               */
  real_T CompareToConstant_const;     /* Mask Parameter: CompareToConstant_const
                                       * Referenced by: '<S43>/Constant'
                                       */
  real_T CompareToConstant_const_h; /* Mask Parameter: CompareToConstant_const_h
                                     * Referenced by: '<S22>/Constant'
                                     */
  real_T CompareToConstant_const_k; /* Mask Parameter: CompareToConstant_const_k
                                     * Referenced by: '<S57>/Constant'
                                     */
  real_T CompareToConstant_const_m; /* Mask Parameter: CompareToConstant_const_m
                                     * Referenced by: '<S29>/Constant'
                                     */
  real_T CompareToConstant_const_g; /* Mask Parameter: CompareToConstant_const_g
                                     * Referenced by: '<S36>/Constant'
                                     */
  real_T CompareToConstant_const_f; /* Mask Parameter: CompareToConstant_const_f
                                     * Referenced by: '<S50>/Constant'
                                     */
  real_T LowPassFilterDiscreteorConti_dy;
                              /* Mask Parameter: LowPassFilterDiscreteorConti_dy
                               * Referenced by: '<S40>/Constant'
                               */
  real_T LowPassFilterDiscreteorConti_ly;
                              /* Mask Parameter: LowPassFilterDiscreteorConti_ly
                               * Referenced by: '<S19>/Constant'
                               */
  real_T LowPassFilterDiscreteorConti_gi;
                              /* Mask Parameter: LowPassFilterDiscreteorConti_gi
                               * Referenced by: '<S54>/Constant'
                               */
  real_T LowPassFilterDiscreteorContin_m;
                              /* Mask Parameter: LowPassFilterDiscreteorContin_m
                               * Referenced by: '<S26>/Constant'
                               */
  real_T LowPassFilterDiscreteorConti_fo;
                              /* Mask Parameter: LowPassFilterDiscreteorConti_fo
                               * Referenced by: '<S33>/Constant'
                               */
  real_T LowPassFilterDiscreteorConti_jr;
                              /* Mask Parameter: LowPassFilterDiscreteorConti_jr
                               * Referenced by: '<S47>/Constant'
                               */
  real_T Out1_Y0;                      /* Computed Parameter: Out1_Y0
                                        * Referenced by: '<S2>/Out1'
                                        */
  real_T Out2_Y0;                      /* Computed Parameter: Out2_Y0
                                        * Referenced by: '<S2>/Out2'
                                        */
  real_T Out3_Y0;                      /* Computed Parameter: Out3_Y0
                                        * Referenced by: '<S2>/Out3'
                                        */
  real_T Out4_Y0;                      /* Computed Parameter: Out4_Y0
                                        * Referenced by: '<S2>/Out4'
                                        */
  real_T Out5_Y0;                      /* Computed Parameter: Out5_Y0
                                        * Referenced by: '<S2>/Out5'
                                        */
  real_T Out6_Y0;                      /* Computed Parameter: Out6_Y0
                                        * Referenced by: '<S2>/Out6'
                                        */
  real_T Out1_Y0_h;                    /* Computed Parameter: Out1_Y0_h
                                        * Referenced by: '<S3>/Out1'
                                        */
  real_T VL53L0XTimeOfFlightSensor_Sampl;/* Expression: -1
                                          * Referenced by: '<Root>/VL53L0X Time Of Flight Sensor'
                                          */
  real_T VL53L0XTimeOfFlightSensor_Sam_e;/* Expression: -1
                                          * Referenced by: '<Root>/VL53L0X Time Of Flight Sensor.'
                                          */
  real_T Constant_Value;               /* Expression: 0
                                        * Referenced by: '<S23>/Constant'
                                        */
  real_T Constant_Value_b;             /* Expression: 0
                                        * Referenced by: '<S30>/Constant'
                                        */
  real_T Constant_Value_o;             /* Expression: 0
                                        * Referenced by: '<S37>/Constant'
                                        */
  real_T Constant_Value_c;             /* Expression: 0
                                        * Referenced by: '<S44>/Constant'
                                        */
  real_T Constant_Value_o1;            /* Expression: 0
                                        * Referenced by: '<S51>/Constant'
                                        */
  real_T Constant_Value_p;             /* Expression: 0
                                        * Referenced by: '<S58>/Constant'
                                        */
  real_T Constant_Value_f;             /* Expression: 1
                                        * Referenced by: '<Root>/Constant'
                                        */
  real_T Integrator_gainval;           /* Computed Parameter: Integrator_gainval
                                        * Referenced by: '<S46>/Integrator'
                                        */
  real_T Integrator_UpperSat;          /* Expression: antiwindupUpperLimit
                                        * Referenced by: '<S46>/Integrator'
                                        */
  real_T Integrator_LowerSat;          /* Expression: antiwindupLowerLimit
                                        * Referenced by: '<S46>/Integrator'
                                        */
  real_T Saturation_UpperSat;          /* Expression: windupUpperLimit
                                        * Referenced by: '<S46>/Saturation'
                                        */
  real_T Saturation_LowerSat;          /* Expression: windupLowerLimit
                                        * Referenced by: '<S46>/Saturation'
                                        */
  real_T Integrator_gainval_j;       /* Computed Parameter: Integrator_gainval_j
                                      * Referenced by: '<S25>/Integrator'
                                      */
  real_T Integrator_UpperSat_f;        /* Expression: antiwindupUpperLimit
                                        * Referenced by: '<S25>/Integrator'
                                        */
  real_T Integrator_LowerSat_f;        /* Expression: antiwindupLowerLimit
                                        * Referenced by: '<S25>/Integrator'
                                        */
  real_T Saturation_UpperSat_b;        /* Expression: windupUpperLimit
                                        * Referenced by: '<S25>/Saturation'
                                        */
  real_T Saturation_LowerSat_d;        /* Expression: windupLowerLimit
                                        * Referenced by: '<S25>/Saturation'
                                        */
  real_T Integrator_gainval_g;       /* Computed Parameter: Integrator_gainval_g
                                      * Referenced by: '<S60>/Integrator'
                                      */
  real_T Integrator_UpperSat_g;        /* Expression: antiwindupUpperLimit
                                        * Referenced by: '<S60>/Integrator'
                                        */
  real_T Integrator_LowerSat_n;        /* Expression: antiwindupLowerLimit
                                        * Referenced by: '<S60>/Integrator'
                                        */
  real_T Saturation_UpperSat_l;        /* Expression: windupUpperLimit
                                        * Referenced by: '<S60>/Saturation'
                                        */
  real_T Saturation_LowerSat_e;        /* Expression: windupLowerLimit
                                        * Referenced by: '<S60>/Saturation'
                                        */
  real_T Integrator_gainval_c;       /* Computed Parameter: Integrator_gainval_c
                                      * Referenced by: '<S32>/Integrator'
                                      */
  real_T Integrator_UpperSat_i;        /* Expression: antiwindupUpperLimit
                                        * Referenced by: '<S32>/Integrator'
                                        */
  real_T Integrator_LowerSat_b;        /* Expression: antiwindupLowerLimit
                                        * Referenced by: '<S32>/Integrator'
                                        */
  real_T Saturation_UpperSat_o;        /* Expression: windupUpperLimit
                                        * Referenced by: '<S32>/Saturation'
                                        */
  real_T Saturation_LowerSat_k;        /* Expression: windupLowerLimit
                                        * Referenced by: '<S32>/Saturation'
                                        */
  real_T Integrator_gainval_k;       /* Computed Parameter: Integrator_gainval_k
                                      * Referenced by: '<S39>/Integrator'
                                      */
  real_T Integrator_UpperSat_p;        /* Expression: antiwindupUpperLimit
                                        * Referenced by: '<S39>/Integrator'
                                        */
  real_T Integrator_LowerSat_o;        /* Expression: antiwindupLowerLimit
                                        * Referenced by: '<S39>/Integrator'
                                        */
  real_T Saturation_UpperSat_g;        /* Expression: windupUpperLimit
                                        * Referenced by: '<S39>/Saturation'
                                        */
  real_T Saturation_LowerSat_dj;       /* Expression: windupLowerLimit
                                        * Referenced by: '<S39>/Saturation'
                                        */
  real_T Integrator_gainval_n;       /* Computed Parameter: Integrator_gainval_n
                                      * Referenced by: '<S53>/Integrator'
                                      */
  real_T Integrator_UpperSat_h;        /* Expression: antiwindupUpperLimit
                                        * Referenced by: '<S53>/Integrator'
                                        */
  real_T Integrator_LowerSat_be;       /* Expression: antiwindupLowerLimit
                                        * Referenced by: '<S53>/Integrator'
                                        */
  real_T Saturation_UpperSat_e;        /* Expression: windupUpperLimit
                                        * Referenced by: '<S53>/Saturation'
                                        */
  real_T Saturation_LowerSat_n;        /* Expression: windupLowerLimit
                                        * Referenced by: '<S53>/Saturation'
                                        */
  real_T Constant2_Value;              /* Expression: 50
                                        * Referenced by: '<Root>/Constant2'
                                        */
  real_T SimulationPace_P1;            /* Expression: SimulationPace
                                        * Referenced by: '<Root>/Simulation Pace.'
                                        */
  real_T SimulationPace_P2;            /* Expression: 2
                                        * Referenced by: '<Root>/Simulation Pace.'
                                        */
  real_T SimulationPace_P3;            /* Expression: OutputPaceError
                                        * Referenced by: '<Root>/Simulation Pace.'
                                        */
  real_T SimulationPace_P4;            /* Expression: SampleTime
                                        * Referenced by: '<Root>/Simulation Pace.'
                                        */
  boolean_T Q_Y0;                      /* Computed Parameter: Q_Y0
                                        * Referenced by: '<S12>/Q'
                                        */
  boolean_T Q_Y0_n;                    /* Computed Parameter: Q_Y0_n
                                        * Referenced by: '<S12>/!Q'
                                        */
  boolean_T _Y0;                       /* Computed Parameter: _Y0
                                        * Referenced by: '<S11>/ '
                                        */
};

/* Real-time Model Data Structure */
struct tag_RTM_ESP32Arm6DOF_T {
  const char_T *errorStatus;
  RTWSolverInfo solverInfo;
  X_ESP32Arm6DOF_T *contStates;
  int_T *periodicContStateIndices;
  real_T *periodicContStateRanges;
  real_T *derivs;
  XDis_ESP32Arm6DOF_T *contStateDisabled;
  boolean_T zCCacheNeedsReset;
  boolean_T derivCacheNeedsReset;
  boolean_T CTOutputIncnstWithState;
  real_T odeY[2];
  real_T odeF[3][2];
  ODE3_IntgData intgData;

