akbar-q/Matlab-Simulink/ESP32Arm6DOF_ert_rtw/ESP32Arm6DOF.h
  /*
   * Sizes:
   * The following substructure contains sizes information
   * for many of the model attributes such as inputs, outputs,
   * dwork, sample times, etc.
   */
  struct {
    int_T numContStates;
    int_T numPeriodicContStates;
    int_T numSampTimes;
  } Sizes;

  /*
   * Timing:
   * The following substructure contains information regarding
   * the timing information for the model.
   */
  struct {
    uint32_T clockTick0;
    time_T stepSize0;
    uint32_T clockTick1;
    time_T tStart;
    SimTimeStep simTimeStep;
    boolean_T stopRequestedFlag;
    time_T *t;
    time_T tArray[2];
  } Timing;
};

/* Block parameters (default storage) */
extern P_ESP32Arm6DOF_T ESP32Arm6DOF_P;

/* Block signals (default storage) */
extern B_ESP32Arm6DOF_T ESP32Arm6DOF_B;

/* Continuous states (default storage) */
extern X_ESP32Arm6DOF_T ESP32Arm6DOF_X;

/* Disabled states (default storage) */
extern XDis_ESP32Arm6DOF_T ESP32Arm6DOF_XDis;

/* Block states (default storage) */
extern DW_ESP32Arm6DOF_T ESP32Arm6DOF_DW;

/* Zero-crossing (trigger) state */
extern PrevZCX_ESP32Arm6DOF_T ESP32Arm6DOF_PrevZCX;

/* External outputs (root outports fed by signals with default storage) */
extern ExtY_ESP32Arm6DOF_T ESP32Arm6DOF_Y;

/* Model entry point functions */
extern void ESP32Arm6DOF_initialize(void);
extern void ESP32Arm6DOF_step(void);
extern void ESP32Arm6DOF_terminate(void);

/* Real-time Model object */
extern RT_MODEL_ESP32Arm6DOF_T *const ESP32Arm6DOF_M;
extern volatile boolean_T stopRequested;
extern volatile boolean_T runModel;

/*-
 * These blocks were eliminated from the model due to optimizations:
 *
 * Block '<Root>/Constant.' : Unused code path elimination
 * Block '<S12>/Logic' : Unused code path elimination
 * Block '<Root>/Distance in mm' : Unused code path elimination
 * Block '<S99>/Proportional Gain' : Unused code path elimination
 * Block '<S103>/Sum' : Unused code path elimination
 * Block '<Root>/Relational Operator.' : Unused code path elimination
 * Block '<Root>/Scope' : Unused code path elimination
 * Block '<Root>/Scope.' : Unused code path elimination
 * Block '<Root>/Scope1' : Unused code path elimination
 * Block '<Root>/Scope2' : Unused code path elimination
 * Block '<Root>/Scope3' : Unused code path elimination
 * Block '<Root>/Scope4' : Unused code path elimination
 * Block '<Root>/Scope5' : Unused code path elimination
 */

/*-
 * The generated code includes comments that allow you to trace directly
 * back to the appropriate location in the model.  The basic format
 * is <system>/block_name, where system is the system number (uniquely
 * assigned by Simulink) and block_name is the name of the block.
 *
 * Use the MATLAB hilite_system command to trace the generated code back
 * to the model.  For example,
 *
 * hilite_system('<S3>')    - opens system 3
 * hilite_system('<S3>/Kp') - opens and selects block Kp which resides in S3
 *
 * Here is the system hierarchy for this model
 *
 * '<Root>' : 'ESP32Arm6DOF'
 * '<S1>'   : 'ESP32Arm6DOF/D Latch.'
 * '<S2>'   : 'ESP32Arm6DOF/Enabled Subsystem'
 * '<S3>'   : 'ESP32Arm6DOF/Enabled Subsystem.'
 * '<S4>'   : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)'
 * '<S5>'   : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)1'
 * '<S6>'   : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)2'
 * '<S7>'   : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)3'
 * '<S8>'   : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)4'
 * '<S9>'   : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)5'
 * '<S10>'  : 'ESP32Arm6DOF/PID Controller.'
 * '<S11>'  : 'ESP32Arm6DOF/Sample and Hold'
 * '<S12>'  : 'ESP32Arm6DOF/D Latch./D Latch'
 * '<S13>'  : 'ESP32Arm6DOF/Enabled Subsystem/Base Signal Editor'
 * '<S14>'  : 'ESP32Arm6DOF/Enabled Subsystem/Claw Signal Editor'
 * '<S15>'  : 'ESP32Arm6DOF/Enabled Subsystem/Lower Signal Editor'
 * '<S16>'  : 'ESP32Arm6DOF/Enabled Subsystem/Mid Signal Editor'
 * '<S17>'  : 'ESP32Arm6DOF/Enabled Subsystem/Rotation Signal Editor'
 * '<S18>'  : 'ESP32Arm6DOF/Enabled Subsystem/Upper Signal Editor'
 * '<S19>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)/Enable//disable time constant'
 * '<S20>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)/Initialization'
 * '<S21>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)/Integrator (Discrete or Continuous)'
 * '<S22>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)/Enable//disable time constant/Compare To Constant'
 * '<S23>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)/Enable//disable time constant/Compare To Zero'
 * '<S24>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)/Initialization/Init_u'
 * '<S25>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)/Integrator (Discrete or Continuous)/Discrete'
 * '<S26>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)1/Enable//disable time constant'
 * '<S27>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)1/Initialization'
 * '<S28>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)1/Integrator (Discrete or Continuous)'
 * '<S29>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)1/Enable//disable time constant/Compare To Constant'
 * '<S30>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)1/Enable//disable time constant/Compare To Zero'
 * '<S31>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)1/Initialization/Init_u'
 * '<S32>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)1/Integrator (Discrete or Continuous)/Discrete'
 * '<S33>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)2/Enable//disable time constant'
 * '<S34>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)2/Initialization'
 * '<S35>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)2/Integrator (Discrete or Continuous)'
 * '<S36>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)2/Enable//disable time constant/Compare To Constant'
 * '<S37>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)2/Enable//disable time constant/Compare To Zero'
 * '<S38>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)2/Initialization/Init_u'
 * '<S39>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)2/Integrator (Discrete or Continuous)/Discrete'
 * '<S40>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)3/Enable//disable time constant'
 * '<S41>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)3/Initialization'
 * '<S42>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)3/Integrator (Discrete or Continuous)'
 * '<S43>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)3/Enable//disable time constant/Compare To Constant'
 * '<S44>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)3/Enable//disable time constant/Compare To Zero'
 * '<S45>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)3/Initialization/Init_u'
 * '<S46>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)3/Integrator (Discrete or Continuous)/Discrete'
 * '<S47>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)4/Enable//disable time constant'
 * '<S48>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)4/Initialization'
 * '<S49>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)4/Integrator (Discrete or Continuous)'
 * '<S50>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)4/Enable//disable time constant/Compare To Constant'
 * '<S51>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)4/Enable//disable time constant/Compare To Zero'
 * '<S52>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)4/Initialization/Init_u'
 * '<S53>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)4/Integrator (Discrete or Continuous)/Discrete'
 * '<S54>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)5/Enable//disable time constant'
 * '<S55>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)5/Initialization'
 * '<S56>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)5/Integrator (Discrete or Continuous)'
 * '<S57>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)5/Enable//disable time constant/Compare To Constant'
 * '<S58>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)5/Enable//disable time constant/Compare To Zero'
 * '<S59>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)5/Initialization/Init_u'
 * '<S60>'  : 'ESP32Arm6DOF/Low-Pass Filter (Discrete or Continuous)5/Integrator (Discrete or Continuous)/Discrete'
 * '<S61>'  : 'ESP32Arm6DOF/PID Controller./Anti-windup'
 * '<S62>'  : 'ESP32Arm6DOF/PID Controller./D Gain'
 * '<S63>'  : 'ESP32Arm6DOF/PID Controller./External Derivative'
 * '<S64>'  : 'ESP32Arm6DOF/PID Controller./Filter'
 * '<S65>'  : 'ESP32Arm6DOF/PID Controller./Filter ICs'
 * '<S66>'  : 'ESP32Arm6DOF/PID Controller./I Gain'
 * '<S67>'  : 'ESP32Arm6DOF/PID Controller./Ideal P Gain'
 * '<S68>'  : 'ESP32Arm6DOF/PID Controller./Ideal P Gain Fdbk'
 * '<S69>'  : 'ESP32Arm6DOF/PID Controller./Integrator'
 * '<S70>'  : 'ESP32Arm6DOF/PID Controller./Integrator ICs'
 * '<S71>'  : 'ESP32Arm6DOF/PID Controller./N Copy'
 * '<S72>'  : 'ESP32Arm6DOF/PID Controller./N Gain'
 * '<S73>'  : 'ESP32Arm6DOF/PID Controller./P Copy'
 * '<S74>'  : 'ESP32Arm6DOF/PID Controller./Parallel P Gain'
 * '<S75>'  : 'ESP32Arm6DOF/PID Controller./Reset Signal'
 * '<S76>'  : 'ESP32Arm6DOF/PID Controller./Saturation'
 * '<S77>'  : 'ESP32Arm6DOF/PID Controller./Saturation Fdbk'
 * '<S78>'  : 'ESP32Arm6DOF/PID Controller./Sum'
 * '<S79>'  : 'ESP32Arm6DOF/PID Controller./Sum Fdbk'
 * '<S80>'  : 'ESP32Arm6DOF/PID Controller./Tracking Mode'
 * '<S81>'  : 'ESP32Arm6DOF/PID Controller./Tracking Mode Sum'
 * '<S82>'  : 'ESP32Arm6DOF/PID Controller./Tsamp - Integral'
 * '<S83>'  : 'ESP32Arm6DOF/PID Controller./Tsamp - Ngain'
 * '<S84>'  : 'ESP32Arm6DOF/PID Controller./postSat Signal'
 * '<S85>'  : 'ESP32Arm6DOF/PID Controller./preSat Signal'
 * '<S86>'  : 'ESP32Arm6DOF/PID Controller./Anti-windup/Passthrough'
 * '<S87>'  : 'ESP32Arm6DOF/PID Controller./D Gain/Internal Parameters'
 * '<S88>'  : 'ESP32Arm6DOF/PID Controller./External Derivative/Error'
 * '<S89>'  : 'ESP32Arm6DOF/PID Controller./Filter/Cont. Filter'
 * '<S90>'  : 'ESP32Arm6DOF/PID Controller./Filter ICs/Internal IC - Filter'
 * '<S91>'  : 'ESP32Arm6DOF/PID Controller./I Gain/Internal Parameters'
 * '<S92>'  : 'ESP32Arm6DOF/PID Controller./Ideal P Gain/Passthrough'
 * '<S93>'  : 'ESP32Arm6DOF/PID Controller./Ideal P Gain Fdbk/Disabled'
 * '<S94>'  : 'ESP32Arm6DOF/PID Controller./Integrator/Continuous'
 * '<S95>'  : 'ESP32Arm6DOF/PID Controller./Integrator ICs/Internal IC'
 * '<S96>'  : 'ESP32Arm6DOF/PID Controller./N Copy/Disabled'
 * '<S97>'  : 'ESP32Arm6DOF/PID Controller./N Gain/Internal Parameters'
 * '<S98>'  : 'ESP32Arm6DOF/PID Controller./P Copy/Disabled'
 * '<S99>'  : 'ESP32Arm6DOF/PID Controller./Parallel P Gain/Internal Parameters'
 * '<S100>' : 'ESP32Arm6DOF/PID Controller./Reset Signal/Disabled'
 * '<S101>' : 'ESP32Arm6DOF/PID Controller./Saturation/Passthrough'
 * '<S102>' : 'ESP32Arm6DOF/PID Controller./Saturation Fdbk/Disabled'
 * '<S103>' : 'ESP32Arm6DOF/PID Controller./Sum/Sum_PID'
 * '<S104>' : 'ESP32Arm6DOF/PID Controller./Sum Fdbk/Disabled'
 * '<S105>' : 'ESP32Arm6DOF/PID Controller./Tracking Mode/Disabled'
 * '<S106>' : 'ESP32Arm6DOF/PID Controller./Tracking Mode Sum/Passthrough'
 * '<S107>' : 'ESP32Arm6DOF/PID Controller./Tsamp - Integral/TsSignalSpecification'
 * '<S108>' : 'ESP32Arm6DOF/PID Controller./Tsamp - Ngain/Passthrough'
 * '<S109>' : 'ESP32Arm6DOF/PID Controller./postSat Signal/Forward_Path'
 * '<S110>' : 'ESP32Arm6DOF/PID Controller./preSat Signal/Forward_Path'
 */
#endif                                 /* ESP32Arm6DOF_h_ */

/*
 * File trailer for generated code.
 *
 * [EOF]
 */
